%% Функция, возвращающая все гомоморфизмы графа
function [M] = homomorphisms(E)
%% Количество вершин
l = max(E(:));
%% Массив всех возможных отображений вершин
C = permn(1:l, l);

%% Массив всех гомоморфных отображений
M = [];

for i=1:length(C)
    %% Текущее отображение каждой вершины
    F = C(i, :);
    
    f = 0;
    %% Отображение вершин каждого ребра
    for j=1:length(E)
        %% Отображенное ребро
        e = F(E(:, j));
        
        %% Если не получилась петля и такого ребра нет в исходном графе
        if (e(1) ~= e(2) && ~any(all(E == rot90(e, -1))) && ~any(all(E == rot90(e, 1))))
            f = 1;
            break;
        end
    end
    
    if (f ~= 1)
        M = [M; F];
    end
end
