%% Функция, возвращающая последовательности вершин, соответствующих максикоду
function[p_max] = maxicode(A)
% Размер исходной матрицы
l = length(A);

% Функция, возвращающая следующую перестановку
H = nextperm(l, l);

% Формируем матрицу степеней двойки для расчета макси-кода
pows = rot90(reshape(pow2(1:l*l), size(A)), 2)';

n_max = 0;
p_max = 1:l;

% Количество всех перестановок равно l!
for i = 1:factorial(l)
    % Получаем следующую перестановку
    p = H();
    % Меняем стобцы и строки в матрице соответственно перестановке
    A_p = A(p, p);
    % Находим код получившейся матрицы
    n = sum(sum(A_p .* pows));
    
    if (n > n_max)
        n_max = n;
        p_max = p;
    elseif (n == n_max)
        p_max = [p_max; p];
    end
end
